Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F32A.tmx
Source language: en_us
Languages: zh_cn

source: Around the world by rail: part three - Bangkok to Singapore
zh_cn: 环球火车旅行记：从曼谷到新加坡（3）

source: You are very lucky people," the train manager says as we board the Eastern & Oriental Express at Bangkok's crowded, steamy Hualamphong station in the late afternoon. "You are going to see many faces of Asia."
zh_cn: “你们很幸运，”当我们从曼谷潮湿拥挤的华南篷火车站乘上东方快车时，列车长这样对我们说，“你们将会看见亚洲的许多面孔。”

source: There is no time to ask him precisely what he means but on one level he is rather stating the obvious, for to travel from Bangkok to Singapore is to move from the chaotic rough-and-tumble Asia of the last century to the ordered, organised and super-efficient Asia of the 21st century, from frenzied, exotic Thailand after Thaksin Shinawatra to Lee Kuan Yew's modern economic tiger.
zh_cn: 我们没时间问他这样说究竟是什么意思，但是从某种层面上来说他是在说一个显而易见的事实，因为从曼谷到新加坡的旅行将把我们从嘈杂混乱的上世纪亚洲带到高效有序的21世纪新亚洲，从他信.西那瓦统治过的狂热奇异的泰国到李光耀领导下的现代化经济老虎。

source: And to travel between the great Asian centres by luxury train is to witness these contrasting aspects in slow motion.
zh_cn: 我们乘坐着豪华列车缓缓驶过亚洲腹地，为的是亲睹这些对比鲜明的风景。

source: As the train pulls out of the station promptly at 17.50 I feel a twinge of sadness leaving behind a city that over three decades I have come to love.
zh_cn: 当列车准时于17:50驶出火车站时，我为离开这个我在过去三十年里一直热爱的城市而感到有些许伤感。

source: I had arrived in Bangkok some 48 hours earlier, to adjust to local time and also to have a considered stroll around one of Asia's most vivid cities.
zh_cn: 我在48小时前抵达曼谷，让自己适应了一下当地时间，也按原先的打算在这个亚洲最富有生气的城市里四处游览了一翻。

source: The first evening I wandered somewhat jet-lagged through the elegant corridors of my hotel, the Mandarin Oriental, and then crossed the Chao Phraya river for a superb Thai dinner at the Sala Rim Naam restaurant. But by day two I'd fully re-engaged with the great sprawling city.
zh_cn: 第一个晚上我感到时差造成的不适，于是就先在我住的东方文华酒店装饰高雅的走廊里走动了一下，然后到湄南河对面的Sala Rim Naam餐厅享用了一顿精美的泰式晚餐，但是到了第二天我就忙于游览这个漫无边际的大城市了。

source: My first stop was a fleeting visit to my favourite tailor, Jack at Premier Tailors, to have a pair of trousers copied.
zh_cn: 我的第一站是探访我最喜爱的裁缝店“Jack at Premier”，在店里我量身定制了一条裤子。

source: Of course his name is not Jack, it is Chaiyakiat Thanaapcharoen, but the point is he'd knock up a decent pair of trousers for less than ?30 by the end of the day.
zh_cn: 当然店主不叫Jack,他的名字是Chaiyakiat Thanaapcharoen，关键在于他当天晚上就能为你做出一条合身的裤子，而价钱还不到30镑。

source: A boat ride along the Chao Phraya followed, then an afternoon visiting the Grand Palace, Wat Phra Kaew (the Temple of the Emerald Buddha) and Wat Pho, site of the famous reclining Buddha; then early evening cocktails at the marvellous Sirocco Sky Bar, which looks out over the city sprawl from the 64th floor of the State Tower building and boasts the largest open-air restaurant in the world.
zh_cn: 接着是在湄南河上乘船巡游，下午参观了大皇宫、玉佛寺和著名的卧佛。傍晚时到美妙的西洛可天空酒吧品尝鸡尾酒，这个酒吧坐落在国家塔大厦64层，在上面可以俯瞰整个城市，据说这是世界上最大的空中餐厅。

source: Then the inevitable visit to Patpong Road.
zh_cn: 再接下来就难免要到帕蓬红灯区去观一下光。

source: This is a family newspaper so it would be inappropriate to discuss in detail the sex menus the young Thai men were brandishing in front of the Western tourists trooping listlessly along this notorious street.
zh_cn: 在这条臭名昭著的街上，年轻的泰国男人在成群结队表情恹恹的西方人面前挥舞着“性”节目的菜单，由于“每日电讯报”是一张家庭报纸，在这里谈论这些菜单上的细节就不那么合适了。

source: Suffice it to say they were rather alarming, even for this old Asia hand.
zh_cn: 只要说这样的场面让人感到惊恐就足够了，即便对我这个老亚洲来说也是如此。

source: Apart from the dubious sex bars, Patpong also serves as a market for fakes, with stalls full of "Mulberry", "Thomas Wylde", "Hermes" products and shiny electronic equipment and gadgetry that costs next to nothing but inevitably breaks down the minute you land in the UK.
zh_cn: 在帕蓬路上除了有那些嗳味不清的色情酒吧，还有一个专卖假货的市场，摊档上面摆满了“迈宝瑞”、“托马斯.沃德”和“爱马仕”等品牌假货，还有五光十色的电子产品。这些货品虽然便宜得难以置信，但是恐怕等你一回到英国它们也就寿终正寝了。

source: By the time I head for Hualamphong station I already feel I am immersed in Asia, so the three-day train ride that lies ahead now strikes me as an added bonus.
zh_cn: 当我前往华南篷火车站去时，我感到自己已经完全沉浸在亚洲的氛围中了，所以我现在面临的三天火车旅行更像是一个额外的奖品。

source: I arrive at the platform to find immaculately liveried Eastern & Oriental stewards leading passengers to their cabins; the train manager is on board, greeting us all with his promises of many faces of Asia.
zh_cn: 在站台上我找到了穿着整洁制服的东方快车列车员，他们将乘客领到各自的车厢里。列车长已经在车上，他向我们承诺我们将看见亚洲的许多面孔。

source: Pretty soon the journey is under way and we pull out of the sprawling Bangkok suburbs and head northwest through paddy fields, past small villages, all of which we watch from the Observation Bar, clutching cocktails, fellow passengers getting to know one another.
zh_cn: 很快我们就上路了，火车朝西北方向驶出广袤的曼谷郊区，经过稻田和小村庄。此时我们坐在观光车厢里手里拿着鸡尾酒杯，旅客们开始互相认识起来。

source: Given that the passing countryside is enveloped in humidity, darkness and low-hanging cloud, there is only one thing for it and that is to start exploring the train, getting used to the sway of the carriages as we clatter west, and to acclimatise to the mobile-phone-and-Wi-Fi-free world of luxury train travel.
zh_cn: 列车经过的乡村被湿热、黑暗和低垂的乌云所笼罩，我们能做的只是开始熟悉一下自己所乘坐的车厢。在西行列车的隆隆声中我们很快就适应了车厢的晃动，还有豪华车厢里的手机无线上网信号。

source: Another cocktail, and then retire to one's cabin to prepare for dinner.
zh_cn: 又喝了一杯鸡尾酒后我们回到自己的车厢里去为晚餐做准备。

source: The cabins come in three categories - from Pullman to Presidential - and again recreate the golden age but with power showers, sockets for hairdryers and other mod cons.
zh_cn: 列车上的车厢有三个等级——从白金到总统——这些车厢都重现了昔日黄金时代的尊荣，又有着淋浴、电吹风插座和其它现代的设施。

source: I can already feel mine will become a quiet sanctuary on this trip.
zh_cn: 我已经能感觉到我的车厢将成为我这次旅途中的庇护所。

source: On the Eastern & Oriental Express the dress code is designed to create an atmosphere of "relaxed refinement", which is shorthand for no jeans or trainers, and gentlemen are expected to wear jacket and tie for dinner.
zh_cn: 东方快车上的着装规定旨在营造一种“轻松高雅”的氛围，也就是婉拒牛仔裤运动装一类的服装，男士须穿西装戴领带去参加晚宴。

source: The dress code and the d¨¦cor are intended to help replicate the golden age of rail travel, and they largely succeed.
zh_cn: 列车上的着装规定和车厢装饰都有助于重现铁路旅行的黄金时代，他们的苦心也确实获得了很大的成功。

source: Most guests dress up, some even turn it into something of a fancy dress parade, and the surroundings do indeed resonate with the sepia photographs of that other age.
zh_cn: 大部分旅客都认真穿戴起来，有些旅客甚至把晚宴当成了一场盛装检阅，现场气氛和墙上挂着的那个时代的黑白照片相得益彰。

source: We are woken at dawn the following morning and the train is already beginning its crossing from Wang Po along the wooden trestle viaduct towards the Kwai Bridge station.
zh_cn: 次日上午我们在黎明时醒来，火车已经开始从望坡沿着木栈桥驶往桂河车站。

source: An engine has been attached to the back of the train and for an hour and 20 minutes we are dragged backwards to Kanchanaburi along part of the old Burma-Siam (Thailand) railway.
zh_cn: 这时列车尾部又加了一个车头，用了1小时20分钟的时间沿着老缅泰铁路把我们拉回到北碧。

source: This is the part of the journey we'd all agreed the previous night that we were anticipating most - it is our visit to the museum and war cemetery at the Bridge over the River Kwai.
zh_cn: 这一段旅程是我们在昨天晚上一致同意，也是我们最为期待的——我们将在桂河大桥参观博物馆和战争公墓。

source: We are escorted from Kanchanaburi railway station to the riverside where we clamber onto a barge and begin a cruise along the river, during which we are treated to a moving and highly informed lecture by an English expat named Hugh Cope.
zh_cn: 从北碧火车站我们被陪送到河边登上了一艘驳船，开始了在河上的巡游。在航行期间我们听了一个内容丰富动人心弦的讲座，是由一位名叫修库珀的英国侨民主讲的。

source: Cope is a former British Telecom executive who moved here from Hong Kong to become the principal River Kwai lecturer and as we head towards the bridge, the museum and the Don Rak war cemetery, he describes the events leading up to the construction of the famous bridge by more than 60,000 Allied POWs and 250,000 Asian forced labourers.
zh_cn: 库珀以前是英国电讯公司的管理人员，他从香港移居到此地来当了一名桂河上的讲师。当我们参观桂河大桥、博物馆和顿拉克战争公墓时，他给我们讲述了修建桂河大桥的历史原因，当时有60000名同盟国战俘和250000名亚洲劳工参加了这项工程的建设。

source: These hours with Hugh Cope, both at the museum and the war cemetery, will remain with me for ever.
zh_cn: 我将永远记住我和库珀一起在博物馆和战争公墓的那些时光。

source: We rejoin our coach for the short ride to the Kanchanaburi railway station to reboard the train and as we head south towards Hua Hin and Ao Noi and eventually to pass along that narrow strip of Thailand separating the Andaman Sea from the Gulf of Thailand, a sumptuous lunch is served.
zh_cn: 回到巴士上开了短短一段路就到了北碧火车站，我们又重新上了火车。火车向南驶往华欣和巴蜀府，最后经过濒临安达曼海的狭长地带，安达曼海的外面是泰国湾，这时列车上供应了丰盛的午餐。

source: The train is rattling through Thai countryside, where villages and communities are living not far from the railway line.
zh_cn: 火车在泰国的乡村隆隆前进，村庄和民居离开铁路线都不远。

source: The clouds have lifted and Buddhist temples, bright golden shrines, glitter in the afternoon sunshine.
zh_cn: 乌云散开了，佛教庙宇和金色圣殿在午后的阳光下熠熠生辉。

source: Through the night the open Thai countryside gives way to Malaysian jungle and, after a midmorning brunch, we come to a halt at Butterworth, Penang's central transport hub, where we are promptly and efficiently decanted into waiting buses and transferred across the channel to George Town, Penang's capital.
zh_cn: 火车开了一夜，开阔的泰国乡村变成了马来西亚的丛林。在吃了早午餐后火车停在了北海车站，北海是槟城的交通枢纽。我们很快下了车上了早已经等在那里的巴士，穿过海峡到了槟城首府乔治城。

source: The highlight in George Town is a visit to Khoo Kongsi, the most important Chinese clan house in Malaysia and, some say, anywhere outside China.
zh_cn: 在乔治城的精彩部分是参观龙山寺，龙山寺是马来西亚甚至是在中国以外任何地方最重要的华人家族祠堂。

source: The complex boasts a magnificent hall embellished with intricate carvings and richly ornamented beams - not a single nail was used in its construction.
zh_cn: 祠堂里有一个画栋雕梁装饰华丽的大厅，在整个大厅的建造过程中没有使用过一根钉子。

source: The saddle-shaped roof reputedly weighs more than 25 tons, and is the best example of the cut-and-paste chien nien technique, where shards of ceramic bowls are used to form patterns, beasts and beings.
zh_cn: 马鞍形的屋顶据说有25吨重，是剪贴技艺的最好样板，屋顶上用瓷碗的薄片粘贴成了各种野兽人物的图样。

source: Out in the tropical heat again, we hail a small fleet of trishaws and wind our way through George Town to the wet market, where, as anticipated, an array of colourful, squirming things are set out for the Chinese clientele who seem prepared to eat anything and everything that moves.
zh_cn: 回到热带的炎热中我们叫了几辆三轮车走过乔治城曲折的街道驶向湿货市场。果然不出我们所料，市场里的货品色彩缤纷生猛鲜活，看来一定很对中国顾客的胃口，据说他们只要是会动的东西都敢吃。

source: Waves of olfactory unpleasantness assail us in the humidity of middle of the day and it is a relief to get back on board the air-conditioned train.
zh_cn: 在中午的湿热天气里有阵阵臭味袭来，回到了有空调的列车上我们顿时感到轻松了许多。

source: It is late afternoon and we pass through Malay royal towns Taipang and Kuala Kangsar, and through swathes of Malaysian jungle in between.
zh_cn: 傍晚时分我们经过了马来皇家城镇太平和瓜拉江沙，以及这些城镇之间的马来西亚丛林。

source: I am immediately reminded of my father's stories of fighting the Japanese army here in the Second World War, then an impenetrable jungle of heat and misery, now penetrated by concrete flyovers and ribbons of asphalt.
zh_cn: 我不由得想起了我父亲在二战期间曾在这里与日军作战，那时这里是难以穿越的深山老林，现在已经建起了钢筋水泥的高架路和柏油路。

source: It's a strange sensation reliving the stories I've had with me all my life in situ and I spend some time sitting quietly in my cabin staring at the jungle with which my soldier father once struggled.
zh_cn: 回到终生伴随着我的那些故事的发生地我感到一阵奇怪的情感冲动，于是我用更多时间静静地坐在车厢里，凝视着我的士兵父亲曾经战斗过的丛林。

source: After breakfast the next morning we cross the Straits of Johor into Singapore, thus ending the train ride.
zh_cn: 次日上午吃过早餐后列车跨越柔佛海峡进入了新加坡，我们的火车旅行也到了终点。

source: However, I am not finished as I am determined to treat myself to 24 hours in Singapore.
zh_cn: 然而我的行程还没有结束，我为自己安排了在新加坡24个小时的游程。

source: It hasn't changed since I was here five years ago, except it seems even cleaner, faster and more efficient than before.
zh_cn: 我五年前曾经到过新加坡，到现在这里似乎没有发生过很大变化，除了看上去比以前更干净，更快速和高效。

source: I pay a sentimental visit to Raffles Long Bar, which despite being a tourist trap is still a lot of fun, but this time I avoid the oversweet, overpriced Singapore Slings in favour of a beer.
zh_cn: 我怀着旧情重访了来福士长廊酒吧，尽管这个酒吧是个游客陷阱但还是能给人带来很多开心。不过这次我没有点味道太甜，价钱太贵的新加坡司令鸡尾酒，而只是点了一杯啤酒。

source: After that I head for the fabulous Ku De Ta Skybar at the Marina Bay Sands, 57 storeys above the city.
zh_cn: 然后我去了神奇的库德塔天空酒吧，这个酒吧在滨海湾金沙酒店的57层楼上。

source: This stay isn't long enough to take in Singapore in all its full thrusting intensity but a swirl around the nightspots confirms that this really is an Asian city in its pomp. I must come back.
zh_cn: 我在新加坡的逗留时间还不足以玩够这个城市，但是在几个夜店逛了一圈后使我确信这正是一个繁华的亚洲城市，我一定会再来。

source: Beware the famous tuk-tuk driver scam in Bangkok whereby customers are told that their intended destination is closed but a better one is available, and that usually takes the customer past a gem shop.
zh_cn: 要当心曼谷突突车骗局，车主会告诉游客他想去的地方已经关门了，可以去一个更好玩的地方，然后把游客带往卖珠宝的商店里。

source: Taxis without meters in Bangkok - they are illegal. And only travel in a metered taxi if the driver turns on the meter.
zh_cn: 在曼谷不打表的出租车是非法的，一定要选打表的出租车。

source: The oversweet and overpriced Singapore Slings at the wonderful, historic Raffles Bar. It's worth a visit but stick to beer.
zh_cn: 在久享盛名的来福士酒吧新加坡司令太甜太贵，这个酒吧值得去看一看，但是只要点啤酒就可以了。

source: Do not try a durian in Singapore. The fruit apparently tastes wonderful, but the smell will follow you around for the rest of your travels.
zh_cn: 在新加坡不要去吃榴莲，这种水果的味道不错，但是它的臭味会在你余下的旅途中始终跟着你。
